
# Класс сообщений
class bot_messages:
    # Приветственное сообщение (/start)
    welcomemessage = "Добро пожаловать в спортивное сообщество\n"
    welcomemessage += "<a href='https://t.me/koshsports'><b>Kosh Sports</b></a>\n\n"
    welcomemessage += "Здесь спортсмены находят себе единомышленников и лучших тренеров, а тренеры находят талантливых учеников.\n"
    welcomemessage += "А кто <b>ты</b>?"

    # Сообщение технической помощи (/help)
    helpmessage = "Сделайте пожалуйста скриншот вашей проблемы и пришлите это нашему техническому специалисту в личные сообщения.\n"

    # Сообщение фаундеров (/helpfounder)
    helpfoundermessage = "Мы создатели сообщества <b>Kosh Sports</b>\nБудем рады если у вас возникли к нам вопросы.\nНапишите нам по одной из кнопок ниже!"

    # Сообщения регистрации профиля
    # Сообщение ввода имени
    messagefirstname = "Хорошо.\n\nВведи пожалуйста Имя"
    # Сообщение ввода фамилии
    messagelastname = "Хорошо.\n\nВведи пожалуйста Фамилию"
    # Сообщение ввода отчество
    messagemiddlename = "Хорошо.\n\nВведи пожалуйста Отчество"
    # Сообщение ввода даты рождения
    messagebirthdate = "Хорошо.\n\nВведи свою Дату рождения в формате:\n'01.01.2025'"
    # Сообщение для ввода города
    messagechoosetown = "Хорошо.\n\nВыбери пожалуйста город из списка внизу"
    # Сообщение для ввода типа спорта
    messagechoosetypesport = "Хорошо.\n\nВыбери пожалуйста вид спорта из списка внизу"
    # Сообщение для ввода уровня спортсмена
    messagechooselevel = "Хорошо.\n\nВыбери пожалуйста свой уровень подготовки"
    # Сообщение для ввода типа помещения
    messagechooseplace = "Хорошо.\n\nВыбери пожалуйста место где будем тренироваться"
    # Сообщение для ввода типа аккаунта
    messagechooseaccaunttype = "Хорошо.\n\nВведи пожалуйста тип аккаунта"
    # Сообщение для отправки фотографии аккаунта
    messageimageuser = "Хорошо.\n\nОтправь мне свою фотографию, чтобы прикрепить её к профилю"
    # Сообщение для ввода описания к анкете
    messagedescription = "Хорошо.\n\nНапиши пожалуйста небольшое описание, к своей анкете"
    # Сообщение для ввода описания к анкете
    messagefinalregistration = "Отлично!\nДавай посмотрим что мы сделали."



    # Неверное сообщение
    wrongcommand = "Эта часть функционала пока не реализована"
    # Сообщание интересующимся телеграмм каналом
    interestinginfo = "В таком случае, рекомендуем подписаться на наш телеграмм канал.\nТам мы выкладываем всю актуальную информацию, а так же будем рады видеть тебя на канале"
    # Сообщение первичное для профиля тренера
    messagecoachstart = "Отлично!😃\nДавай заполни твой профиль, чтобы спортсмены могли найти тебя!😎"



    # Сообщения для успешной записи в базу данных
    messageinsertdatesindatabase = "Поздравляю, ты теперь вместе с нами!"
    # Сообщение о том что такой профиль уже найден в базе данных
    messageprofilealreadyexists = "Выбери что будем делать с профилем."
    # Сообщение про таблицу соревнований
    messagecompetitiontable = "⬇️Ссылка на таблицу ниже⬇️"


# Класс данных для Базы
class dates_for_database:
    # Список городов
    towns = [
        'Омск', 'Томск', 'Москва', 'Новосибирск', 'Санкт-Петербург', 'Сочи',
        'Калининград', 'Владивосток', 'Екатеринбург', 'Казань', 'Красноярск',
        'Нижний Новгород', 'Уфа', 'Самара', 'Ростов-на-Дону', 'Краснодар', 'Пермь',
        'Воронеж']

    # Список видов спорта
    kinds = [
        'Бег', 'Футбол', 'Баскетбол', 'Бокс', 'Велоспорт', 'Волейбол', 'Гольф',
        'Горные лыжи', 'Дзюдо', 'Киберспорт', 'Коньки', 'Легкая атлетика',
        'Настольный теннис', 'Плавание', 'Триатлон', 'Хоккей', 'Шахматы',
        'Футбольный фристайл']

    # Список уровней
    levels = ['Любитель', 'Средний', 'Профессионал']

    # Список ролей
    types = ['Тренер', 'Спортсмен', 'Администратор']

    # Список мест
    places = ['Спортивный клуб/зал', 'Улица', 'Онлайн', 'В любом месте']

# Класс для других ссылок
class helpdates:
    # Путь к таблице соревнований
    googlesheetcompetitiontable = "https://docs.google.com/spreadsheets/d/1syWVu1NE3mKpWU1QUGuYyFVxUNsYjW8TCKq79VfII2g/edit?gid=0#gid=0"
